insert into answer(task_id,answer_name,correct)
values
--Test№1
--task1
(1,'Ліворуч і розворот.',false),
(1,'Ліворуч.',false),
(1,'Прямо, ліворуч і розворот.',true),
(1,'Прямо, праворуч, ліворуч і розворот.',false),
--task2
(2,'Аварійна сигналізація.',true),
(2,'Ближнє світло фар.',false),
(2,'Габаритні ліхтарі.',false),
--task3
(3,'Неправильно.',false),
(3,'Правильно.',true),
--task4
(4,'Може в будь-якому випадку.',false),
(4,'Може за умови, що обгін буде завершено за 100 м до переїзду.',true),
(4,'Не може.',false),
--task5
(5,'У місцях, де транспортний засіб унеможливить рух інших транспортних засобів.',false),
(5,'У місцях, де транспортний засіб створить перешкоду для руху пішоходів.',false),
(5,'На газонах.',false),
(5,'Відповіді 1 і 2.',false),
(5,'Відповіді 1, 2 і 3.',true),
--task6
(6,'Не повинен.',false),
(6,'Повинен.',true),
--task7
(7,'Інформує про те, що дорога повертає праворуч.',false),
(7,'Надає Вам перевагу в разі перестроювання на праву смугу.',false),
(7,'Попереджає про наближення до звуження проїзної частини.',true),
--task8
(8,'Дозволено.',false),
(8,'Заборонено.',true),
--task9
(9,'Відстань, що проходить транспортний засіб під час екстреного гальмування з початку впливу на органи керування гальмовою системою до повної зупинки.',true),
(9,'Відстань, що проходить транспортний засіб, з місця, де починаються чітко виражені сліди гальмування до повної зупинки.',false),
--task10
(10,'З 17:00 до 23:00.',false),
(10,'З 19:00 до 24:00.',true),
(10,'З 7:00 до 24:00.',false),
--task11
(11,'Знак 1.',false),
(11,'Знак 2.',false),
(11,'Знак 3.',true),
(11,'Знак 4.',false),
(11,'Знак 5.',false),
--task12
(12,'Будь-які елементи дорожніх споруд, які становлять небезпеку.',false),
(12,'Тільки вїзд у неосвітлені тунелі.',false),
(12,'Тільки нижній край прогонової будови тунелів, мостів і шляхопроводів.',true),
--task13
(13,'Ні.',true),
(13,'Так, якщо власник пошкодженого майна не має претензій до учасників події.',false),
(13,'Так.',false),
(13,'Жодне з тверджень не вірне.',false),
--task14
(14,'Тільки в разі вчинення дрібного хуліганства.',false),
(14,'Тільки в разі порушення Правил дорожнього руху.',false),
(14,'Проводиться в разі вчинення правопорушень, зазначених у відповідях 1 і 2 з обов''язковим складанням протоколу про затримання.',true),
--task15
(15,'За вїзд на залізничний переїзд у випадках, коли рух через переїзд заборонений.',true),
(15,'За керування транспортним засобом, не зареєстрованим або не перереєстрованим в установленому порядку.',false),
(15,'За перевищення швидкості більш ніж на 20 км/год.',false),
(15,'За порушення вимог дорожніх знаків та розмітки.',false),
--task16
(16,'Дати дорогу велосипедисту в будь – якому випадку.',true),
(16,'Не повинні давати дорогу велосипедисту, так як велосипедист рухається велосипедною доріжкою.',false),
(16,'Посигналити велосипедисту і повернути першим.',false),
--task17
(17,'Відносно лінії, що позначає лівий край проїзної частини дороги.',false),
(17,'Відносно лінії, що позначає правий край проїзної частини дороги.',true),
(17,'Відносно лінії, що розділяє транспортні потоки протилежних напрямків.',false),
--task18
(18,'Вжити заходів, які виключають мимовільний рух транспортного засобу.',false),
(18,'Через дзеркало заднього виду або поворотом голови назад переконатися в безпеці виходу і потім лише виходити.',false),
(18,'У темну пору доби на неосвітленій ділянці дороги (крім житлових зон) ввімкнути габаритні чи стоянкові вогні.',false),
(18,'Виконати все, перелічене вище.',true),
--task19
(19,'Включити світло фар, як тільки автомобіль, що обганяє, виявився попереду, та рухатися з ввімкненими габаритними вогнями до моменту, поки автомобіль, що рухається попереду, не віддалився на значну відстань.',false),
(19,'Відразу переключитися на ближнє світло, як тільки водій наступного за ним автомобіля почав виїжджати на зустрічну смугу руху.',false),
(19,'Переключити фари на ближнє світло у момент, коли автомобілі порівнялися, рухаючись по суміжних смугах.',true),
--task20
(20,'Вийняти стороннє тіло після чого накласти пов’язку.',false),
(20,'Зафіксувати стороннє тіло тільки якщо воно виступає над раною не менше ніж на 5 см.',false),
(20,'Накласти пов’язку, не виймаючи стороннього тіла.',true),

--Test№2
--task1
(21,'За ними або під прямим кутом до краю проїзної частини в місцях, де дорогу добре видно в обидва боки, і лише після того, як переконаються у відсутності небезпеки.',false),
(21,'По них або по лініях тротуарів чи узбіч на перехрестях.',false),
(21,'Тільки по них.',true),
--task2
(22,'Вимагає від водіїв обовязкової зупинки.',false),
(22,'Дозволяє рух й інформує про наявність небезпечного нерегульованого перехрестя.',true),
(22,'Забороняє рух транспортних засобів.',false),
--task3
(23,'Може.',false),
(23,'Не може, оскільки повинен дочекатися ввімкнення зеленого сигналу.',true),
--task4
(24,'Жезла або руки, що вказують на цей транспортний засіб.',false),
(24,'Увімкненого проблискового маячка синього і червоного або лише червоного кольору або спеціального звукового сигналу.',false),
(24,'Гучномовного пристрою.',false),
(24,'Спеціального табло, на якому зазначається вимога про зупинку транспортного засобу.',false),
(24,'Будь-якого з перелічених вище засобів.',true),
--task5
(25,'Водії синього автомобіля і мотоцикла.',false),
(25,'Водії фіолетового автомобіля і мотоцикла.',false),
(25,'Тільки водій мотоцикла.',false),
(25,'Усі водії.',true),
--task6
(26,'Місце перехрещення двох вулиць на одному рівні.',false),
(26,'В''їзд і виїзд із дворів.',false),
(26,'Вїзд і виїзд з автозаправної станції.',false),
(26,'Відповіді 1, 2 і 3.',false),
(26,'Відповіді 2 і 3.',true),
--task7
(27,'Вага транспортного засобу з вантажем, водієм і пасажирами, встановлена технічною характеристикою на даний транспортний засіб підприємством-виробником, яка не повинна перевищувати 3500 кг.',false),
(27,'Маса спорядженого транспортного засобу з вантажем, водієм і пасажирами, що встановлена технічною характеристикою транспортного засобу як максимально допустима.',true),
--task8
(28,'На обох перехрестях ви взагалі не маєте переваги.',false),
(28,'На обох перехрестях.',true),
(28,'Тільки на другому перехресті.',false),
(28,'Тільки на першому перехресті.',false),
--task9
(29,'Заборонено рух транспортних засобів зі швидкістю не меншою, ніж зазначено на знакові.',false),
(29,'Заборонено рух транспортних засобів зі швидкістю, що перевищує зазначену на знакові.',true),
(29,'Заборонено рух транспортних засобів, довжина яких (з вантажем чи без нього) перевищує зазначену на знакові.',false),
(29,'Заборонено рух транспортних засобів, загальна фактична маса яких перевищує зазначену на знакові.',false),
--task10
(30,'Дозволяє виконати поворот ліворуч у зазначеному місці.',false),
(30,'Дозволяє обїзд перешкоди тільки з лівого боку.',true),
(30,'Дозволяє повернути тільки ліворуч.',false),
--task11
(31,'Дозволені напрямки руху транспортних засобів по реверсивній смузі.',false),
(31,'Дозволені напрямки руху транспортних засобів по смугах на перехресті.',false),
(31,'Те, що смуга використовується для руху тільки певних видів транспортних засобів у зазначених напрямках.',true),
--task12
(32,'Дозволяє Вам поворот ліворуч і розворот.',true),
(32,'Дозволяє Вам тільки поворот ліворуч.',false),
(32,'Дозволяє Вам тільки розворот.',false),
--task13
(33,'Дозволено.',true),
(33,'Заборонено.',false),
--task14
(34,'Велосипедисту заборонено повертати наліво в даній ситуації.',false),
(34,'Проїде першим.',false),
(34,'Проїде, давши дорогу автомобілю.',true),
--task15
(35,'Дати дорогу червоному автомобілю.',true),
(35,'Проїхати перехрестя першим.',false),
--task16
(36,'Зі знаком 1.',false),
(36,'Зі знаком 2.',false),
(36,'Зі знаком 3.',false),
(36,'Зі знаком 4.',true),
(36,'Зі знаком 5.',false),
--task17
(37,'Будь-хто з водіїв ТЗ — учасників ДТП.',true),
(37,'Винуватець ДТП.',false),
(37,'Потерпілий в ДТП.',false),
(37,'Це вирішують працівники поліції.',false),
--task18
(38,'Збільшити швидкість руху, зменшивши дистанцію до транспортного засобу, що рухається попереду Вас.',false),
(38,'Попередити наступного ззаду водія різким короткочасним гальмуванням.',false),
(38,'Скорегувати швидкість руху, послабивши натискання на педаль газу, щоб збільшити дистанцію до транспортного засобу, що рухається попереду.',true),
(38,'Допускається будь-яка з наведених дій.',false),
--task19
(39,'Вимкнути двигун і дистанційний вимикач «маси» (при його наявності).',false),
(39,'Дістати вогнегасник і підготувати його до використання.',false),
(39,'Захистити руки від опіку, надівши рукавички або обернувши пальці ганчірям.',false),
(39,'Все перераховане.',true),
--task20
(40,'Збільшується.',true),
(40,'Зменшується.',false),
(40,'Не змінюється.',false),

--Test№3
--task1
(41,'Знаками пріоритету.',false),
(41,'Сигналами регулювальника.',true),
(41,'Сигналами світлофора.',false),
--task2
(42,'Пересуватися тільки групами, по чотири особи в ряд.',false),
(42,'Повинні виділити себе, а за можливості мати на зовнішньому одязі світловідбиваючі елементи для своєчасного виявлення їх іншими учасниками дорожнього руху.',true),
(42,'Відповіді 1 і 2.',false),
--task3
(43,'Аварійна світлова сигналізація.',true),
(43,'Габаритні ліхтарі.',false),
(43,'Стоянкові вогні.',false),
--task4
(44,'Крайню ліву смугу.',false),
(44,'Будь-яку смугу, поворот ліворуч з якої дозволено дорожніми знаками або дорожньою розміткою.',false),
(44,'Відповіді 1 і 2.',true),
--task5
(45,'Повертати тільки з крайніх смуг для руху.',false),
(45,'Не створювати небезпеки чи перешкод іншим учасникам руху.',false),
(45,'У разі потреби для забезпечення безпеки дорожнього руху слід звернутися за допомогою до інших осіб.',false),
(45,'Відповіді 2 і 3.',true),
--task6
(46,'Дозволено.',false),
(46,'Заборонено.',true),
--task7
(47,'Повинен враховувати ширину проїзної частини відповідного напрямку руху, габарити транспортного засобу, дотримуючись при цьому безпечних інтервалів.',true),
(47,'Тільки габарити транспортних засобів.',false),
(47,'Тільки ширину проїзної частини.',false),
--task8
(48,'100 км/год.',false),
(48,'110 км/год.',false),
(48,'70 км/год.',false),
(48,'80 км/год.',false),
(48,'90 км/год.',true),
--task9
(49,'100 м.',false),
(49,'150 м.',false),
(49,'50 м.',true),
--task10
(50,'Дозволена.',false),
(50,'Заборонена.',true),
--task11
(51,'Повинні знизити швидкість, а в разі потреби зупинитися, щоб дати дорогу пішоходам.',true),
(51,'Повинні обїхати пішоходів ззаду.',false),
(51,'Повинні тільки знизити швидкість, щоб дати дорогу пішоходам.',false),
(51,'Повинні тільки зупинитися, щоб дати дорогу пішоходам.',false),
--task12
(52,'Вміст шкідливих речовин у відпрацьованих газах або їх димність перевищує встановлені норми.',false),
(52,'Не працює покажчик температури охолоджуючої рідини.',true),
(52,'Негерметична паливна система.',false),
(52,'Несправна система випускання відпрацьованих газів.',false),
--task13
(63,'Під час буксирування по автомагістралях і дорогах для автомобілів.',false),
(53,'Під час буксирування транспортного засобу з причепом.',false),
(53,'У разі буксирування двох і більше транспортних засобів.',true),
(53,'У разі буксирування по гірських дорогах.',false),
--task14
(54,'Не наражав на небезпеку учасників дорожнього руху, не створював шуму, не піднімав пилу та не забруднював проїзну частину і навколишнє середовище.',false),
(54,'Не обмежував водієві оглядовості.',false),
(54,'Не падав, не волочився, не травмував супроводжуючих осіб і не створював перешкод для руху.',false),
(54,'Відповіді 1 і 2.',false),
(54,'Відповіді 1, 2 і 3.',true),
--task15
(55,'Не узгоджується.',false),
(55,'Узгоджується лише встановлення світлових покажчиків.',false),
(55,'Узгоджується.',true),
--task16
(56,'Не узгоджується.',false),
(56,'Узгоджується лише встановлення світлових покажчиків.',false),
(56,'Узгоджується.',true),
--task17
(57,'Про наближення до залізничного переїзду поза населеними пунктами.',true),
(57,'Про наближення до не обладнаного шлагбаумом переїзду через залізницю з двома та більше коліями.',false),
(57,'Варіанти 1 та 2.',false),
--task18
(58,'Будь-якого пішохідного переходу.',false),
(58,'Місця перетину велосипедної доріжки.',false),
(58,'Місця, на якому можлива поява дітей.',false),
(58,'Нерегульованого пішохідного переходу.',true),
--task19
(59,'Дати дорогу всім автомобілям.',false),
(59,'Дати дорогу тільки зустрічному автомобілю.',true),
(59,'Проїхати перехрестя першим.',false),
--task20
(60,'Давши дорогу білому автомобілю.',true),
(60,'Першим.',false),

--Test№4
--task1
(61,'Перетин дороги з трамвайними коліями на одному рівні..',false),
(61,'Перетин дороги із залізничними коліями на одному рівні.',true),
(61,'Перехрещення дороги із залізничними коліями на різних рівнях.',false),
(61,'Відповіді, зазначені в пунктах 1 та 2.',false),
--task2
(62,'Дозволено тільки у світлу пору доби.',false),
(62,'Дозволено, якщо віз обладнаний світлоповертачами.',false),
(62,'Заборонено (за змогою слід пересуватися автомобільними дорогами місцевого значення).',true),
--task3
(63,'Дозволяється рух заднім ходом на дорогах з одностороннім рухом за умови забезпечення безпеки руху та неможливості під''їхати до об''єкта іншим способом',true),
(63,'Рух заднім ходом на дорогах з одностороннім рухом заборонено.',false),
--task4
(64,'Завжди під час випередження або перед поворотом ліворуч, а також перед розворотом.',false),
(64,'Завжди для виконання обїзду.',false),
(64,'За умови, що рух не заборонено дорожніми знаками чи дорожньою розміткою, а також під час випередження, обїзду, коли ширина проїзної частини недостатня для виконання об''їзду без виїзду на трамвайну колію.',true),
(64,'Відповіді 1 і 2.',false),
--task5
(65,'Має, оскільки поворот ліворуч він повинен виконувати з трамвайної колії попутного напрямку.',false),
(65,'Не має права.',true),
--task6
(66,'Тільки суд.',false),
(66,'Тільки вищестоящий орган (вища посадова особа) щодо органу, який застосував ці заходи.',false),
(66,'Органи, зазначені у відповідях 1 і 2.',true),
--task7
(67,'Дозволено.',true),
(67,'Заборонено.',false),
--task8
(68,'Знак 1.',false),
(68,'Знак 2.',false),
(68,'Знак 3.',true),
(68,'Знак 4.',false),
--task9
(69,'Визначає територію в населеному пункті, на якій заборонено зупинку всіх транспортних засобів.',false),
(69,'Визначає територію в населеному пункті, на якій тривалість стоянки обмежена незалежно від того, чи справляється за це плата.',true),
(69,'Забороняє стоянку всіх транспортних засобів на тому боці дороги, на якому він встановлений.',false),
(69,'Не дозволяє зупинку всіх транспортних засобів на тому боці дороги, на якому він встановлений.',false),
--task10
(70,'Для позначення місць і майданчиків під дахом для стоянки транспортних засобів.',true),
(70,'Для позначення місць і майданчиків для стоянки транспортних засобів.',false),
(70,'Для позначення місць і майданчиків під дахом для стоянки транспортних засобів, де є можливість пересадки на маршрутні транспортні засоби.',false),
(70,'Відповіді 1, 2 і 3.',false),
--task11
(71,'Ні.',true),
(71,'Так, якщо пошкоджено не більше 5 ТЗ.',false),
(71,'Так, якщо шкода завдана третьому ТЗ незначна.',false),
(71,'Так.',false),
--task12
(72,'100 тисяч грн.',false),
(72,'200 тисяч грн.',false),
(72,'25 тисяч грн.',false),
(72,'50 тисяч грн.',true),
--task13
(73,'Водіями ТЗ, що є учасниками ДТП.',true),
(73,'Водієм ТЗ винного у ДТП та потерпілими.',false),
(73,'Співробітниками поліції.',false),
(73,'Всі відповіді вірні.',false),
--task14
(74,'Вищою, ніж насправді.',false),
(74,'Нижчою, ніж насправді.',true),
(74,'Сприйняття швидкості не змінюється.',false),
--task15
(75,'Час з моменту виявлення водієм небезпеки до повної зупинки транспортного засобу.',false),
(75,'Час з моменту виявлення водієм небезпеки чи перешкоди для руху до початку вжиття ним заходів задля запобігання контакту з ними.',true),
(75,'Час, необхідний для перенесення ноги з педалі подачі палива на педаль гальма.',true),
--task16
(76,'Завчасно знизити швидкість, щоб у разі потреби зупинитися перед «стоп-лінією» при ввімкненні заборонного сигналу світлофора, не вдаючись до екстреного гальмування.',true),
(76,'Збільшити швидкість, щоб встигнути проїхати перехрестя до ввімкнення заборонного сигналу світлофора.',false),
(76,'Не змінювати швидкість руху, а якщо до ввімкнення червоного сигналу проїхати перехрестя не вдасться - загальмувати перед «стоп-лінією».',false),
--task17
(77,'Вік.',false),
(77,'Освіта.',true),
(77,'Температура в салоні автомобіля.',false),
(77,'Час доби.',false),
(77,'Час перебування за кермом.',false),
--task18
(78,'За допомогою кровоспинного джгута.',false),
(78,'Накладанням пов’язки, що тисне.',true),
(78,'Як правило, зупиняється самостійно.',false),
--task19
(79,'Накладання кровоспинного джгута.',false),
(79,'Накладання тугої бинтової пов’язки.',false),
(79,'Пальцеве притискання рани.',true),
--task20
(80,'Ви вмикаєте правий покажчик повороту, щоб привернути до себе увагу.',false),
(80,'Ви подаєте звуковий сигнал та продовжуєте рух, тому що у вас перевага.',false),
(80,'Ви не пропускаєте жовтий автомобіль, тому що він їде по колу.',false),
(80,'Ви починаєте гальмування та виїжджаєте на перехрестя, дотримуючись безпечної дистанції.',true),

--Test№5
--task1
(81,'З увімкненим проблисковим маячком оранжевого кольору разом зі спеціальним звуковим сигналом, за умови забезпечення безпеки дорожнього руху.',false),
(81,'За умови увімкнення проблискового маячка синього або червоного кольору та забезпечення безпеки дорожнього руху.',true),
--task2
(82,'Виділити себе або мати на зовнішньому одязі світловідбиваючі елементи.',false),
(82,'Переконатися, що це буде безпечно та не створить перешкод іншим учасникам руху.',true),
(82,'Відповіді 1 і 2.',false),
--task3
(83,'Ліворуч або у зворотному напрямку.',true),
(83,'Ліворуч.',false),
(83,'У зворотному напрямку.',false),
--task4
(84,'Аварійна сигналізація.',false),
(84,'Покажчик повороту.',true),
(84,'Стоянкові вогні.',false),
--task5
(85,'Дистанція повинна дати змогу транспортним засобам, що виконують їх обгін, безперешкодно повернутися на раніш займану смугу.',true),
(85,'З будь-якою, на розсуд водія.',false),
(85,'З такою, за якої неможливий наїзд ззаду.',false),
--task6
(86,'Дозволено в будь-якому випадку.',false),
(86,'Дозволено, якщо включені денні ходові вогні.',false),
(86,'Заборонено.',true),
--task7
(87,'У разі оформлення дорожньо-транспортної пригоди.',false),
(87,'У разі виконання дорожніх робіт або робіт, повязаних із зайняттям проїзної частини.',false),
(87,'У разі обмеження або заборони руху транспортних засобів і пішоходів у передбачених законодавством випадках.',false),
(87,'Відповіді 1, 2 і 3.',true),
--task8
(88,'Другим.',false),
(88,'Першим.',true),
(88,'Третім.',false),
--task9
(89,'Має право.',true),
(89,'Не має права: виїзд на смугу йому заборонено.',false),
--task10
(90,'Із несправним рульовим керуванням.',true),
(90,'З негерметичною гальмовою системою.',false),
(90,'З несправною аварійною сигналізацією.',false),
(90,'Відповіді 1, 2 і 3.',false),
--task11
(91,'Нанесення білих смуг під нахилом на зовнішні бічні поверхні транспортних засобів.',false),
(91,'Переобладнання транспортних засобів.',false),
(91,'Відповіді 1 і 2.',true),
--task12
(92,'«Початок населеного пункту» і «Кінець населеного пункту» на білому фоні.',false),
(92,'«Початок населеного пункту» і «Кінець населеного пункту» на синьому фоні.',false),
(92,'Забудована територія, вїзди на яку і виїзди з якої позначаються дорожніми знаками 5.45, 5.46, 5.47, 5.48.',true),
--task13
(93,'Для руху.',false),
(93,'Для зупинки та стоянки.',true),
(93,'Відповіді, зазначені у пунктах 1, 2.',false),
--task14
(94,'Маєте в будь-якому разі.',true),
(94,'Маєте, тільки якщо встановлено знак «Головна дорога».',false),
(94,'Не маєте.',false),
--task15
(95,'Повідомити про дорожньо-транспортну пригоду страхову компанію.',false),
(95,'Не переміщувати транспортний засіб і предмети, що мають причетність до події, а також вжити можливих заходів для надання першої медичної допомоги потерпілим, викликати карету швидкої медичної допомоги, а якщо це неможливо, звернутися за допомогою до присутніх і відправити потерпілих до лікувального закладу.',true),
(95,'Відповіді 1 і 2.',false),
--task16
(96,'10-15 м.',true),
(96,'150-300 м.',false),
(96,'50-100 м.',false),
(96,'Безпосередньо перед таким місцем.',false),
--task17
(97,'Білий автомобіль.',false),
(97,'Жовтий автомобіль.',false),
(97,'Зелений автомобіль.',false),
(97,'Сірий автомобіль.',true),
--task18
(98,'Дати дорогу тільки трамваю.',false),
(98,'Проїхати перехрестя першим.',false),
(98,'Проїхати перехрестя після трамвая і синього автомобіля.',true),
--task19
(99,'Зайняти відповідне крайнє праве положення.',false),
(99,'Переконатися у тому, що це не створить перешкод або небезпеки іншим учасникам руху.',false),
(99,'Переконатися у тому, що це буде безпечно.',false),
(99,'Виконати усі вищеперераховані дії.',true),
--task20
(100,'Застосовуються тільки зі знаком обмеження швидкості.',false),
(100,'Застосовуються тільки як тимчасові знаки.',false),
(100,'Повинні встановлюватися з двох сторін проїжджої частини.',false),
(100,'Повторюються в населеному пункті.',true),

--Test№6
--task1
(101,'Не повинен у разі, якщо він уже почав перестроювання.',false),
(101,'Не повинен, оскільки був увімкнений покажчик повороту.',false),
(101,'Повинен дати дорогу, оскільки подавання попереджувального сигналу покажчиками повороту не дає водію переваги і не звільняє його від вжиття запобіжних заходів.',true),
--task2
(102,'Ближнє світло фар і аварійна сигналізація.',false),
(102,'Тільки аварійна сигналізація.',true),
(102,'Тільки ближнє світло фар.',false),
--task3
(103,'Обидва варіанти правильні.',false),
(103,'За траєкторією А.',false),
(103,'За траєкторією Б.',true),
--task4
(104,'Дозволено, якщо довжина гнучкого зчеплення достатня.',false),
(104,'Заборонено.',true),
--task5
(105,'У всіх місцях.',false),
(105,'У місцях А та Д.',true),
(105,'У місцях А, В і Д.',false),
(105,'У місцях Г і Д.',false),
(105,'У місці В.',false),
--task6
(106,'У тому, що проїзна частина вільна від інших транспортних засобів.',false),
(106,'У тому, що це не загрожує безпеці дорожнього руху.',false),
(106,'У тому, що це не створює перешкод іншим учасникам дорожнього руху.',false),
(106,'Відповіді 2 і 3.',true),
--task7
(107,'На місці А чи Б.',false),
(107,'На місці А.',true),
(107,'На місці Б.',false),
--task8
(108,'На залізничних переїздах з шлагбаумом.',false),
(108,'На залізничних переїздах без шлагбаума.',false),
(108,'У будь-якому місці, де залізничні колії добре проглядаються.',false),
(108,'На будь-якому залізничному переїзді.',true),
(108,'Відповіді 3 і 4.',false),
--task9
(109,'Дорожньої розміткою.',false),
(109,'Дорожніми знаками.',false),
(109,'Світловою і звуковою сигналізацією.',false),
(109,'Тільки дорожніми знаками і дорожньою розміткою.',false),
(109,'Усім переліченим вище.',true),
--task10
(110,'Зупинитися в передбаченому місці, так як проїзд через переїзд заборонений.',true),
(110,'Проїхати залізничний переїзд.',false),
--task11
(111,'Установка розпізнавального знака «Колона» не обовязкова.',false),
(111,'На кожному транспортному засобі вмикається ближнє світло фар.',false),
(111,'На кожному транспортному засобі вмикаються денні ходові вогні або ближнє світло фар..',false),
(111,'Відповіді 1 і 2.',true),
(111,'Відповіді 1 і 3.',false),
--task12
(112,'Про те, що дорога виходить на берег водойми або набережну.',true),
(112,'Про те, що дорога виходить на поромну переправу.',false),
(112,'Про те, що дорога проходить через розвідний міст.',false),
--task13
(113,'Повинні бути обладнані розпізнавальними знаками «Учбовий транспортний засіб», встановленими відповідно до вимог Правил дорожнього руху.',false),
(113,'Повинні бути обладнані додатковими педалями зчеплення (у разі якщо конструкція транспортного засобу передбачає педаль зчеплення), акселератора (у разі якщо конструкція транспортного засобу допускає можливість обладнання такою педаллю) і гальмування.',false),
(113,'Дзеркалом або дзеркалами заднього виду для спеціаліста з підготовки водіїв.',false),
(113,'Відповіді 1 і 2.',false),
(113,'Відповіді 1, 2 і 3.',true),
--task14
(114,'Дозволяється.',false),
(114,'Забороняється лише на дорогах без штучного освітлення.',false),
(114,'Забороняється.',true),
--task15
(115,'Водій білого автомобіля.',false),
(115,'Водій синього автомобіля.',false),
(115,'Обидва водії.',true),
--task16
(116,'Жовтий і зелений.',true),
(116,'Жовтий.',false),
(116,'Усі автомобілі.',false),
(116,'Чорний і червоний.',false),
--task17
(117,'Ліворуч або у зворотному напрямку.',false),
(117,'Прямо або ліворуч.',false),
(117,'Прямо, ліворуч або у зворотному напрямку.',true),
(117,'Тільки ліворуч.',false),
--task18
(118,'Дати дорогу білому автомобілю.',true),
(118,'Проїхати перехрестя першим, не даючи дорогу.',false),
--task19
(119,'Знак 1.',true),
(119,'Знак 2.',false),
(119,'Знак 3.',false),
(119,'Знак 4.',false),
--task20
(120,'Кінець зони дії дорожнього знака, з яким вона встановлена.',false),
(120,'Початок зони дії дорожнього знака, з яким вона встановлена.',false),
(120,'Смугу руху, на яку поширюється дія знака або світлофора, з яким вона встановлена.',true),

--Test№7
--task1
(121,'Дозволено, оскільки поворот ліворуч він повинен виконувати з трамвайної колії попутного напрямку.',false),
(121,'Заборонено.',true),
--task2
(122,'Може, увімкнувши звуковий сигнал.',false),
(122,'Не може - повинен дочекатися, поки сірий автомобіль завершить обгін.',true),
--task3
(123,'Дозволено в будь-якому випадку.',false),
(123,'Дозволено, якщо швидкість автомобіля, що обганяється, менше 30 км/год.',false),
(123,'Заборонено.',true),
--task4
(124,'У місці А і В.',true),
(124,'У місці А, Б і В.',false),
(124,'У місці А.',false),
(124,'У місці Б.',false),
(124,'У місці В.',false),
--task5
(125,'Може, тому що перебуває на головній дорозі.',false),
(125,'Може, тому що рухається прямо.',false),
(125,'Не може, тому що, зупинившись, створить перешкоду для руху іншим транспортним засобам.',true),
--task6
(126,'Завжди в темний час доби або в умовах недостатньої видимості.',false),
(126,'Під час виконання службових завдань, вживши заходів для того, щоб не засліплювати інших учасників дорожнього руху.',true),
--task7
(127,'Реєстраційний документ на транспортний засіб.',false),
(127,'Посвідчення водія на право керування транспортним засобом відповідної категорії і поліс (сертифікат) обов''язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів.',false),
(127,'Генеральна довіреність на транспортний засіб або тимчасовий реєстраційний талон.',false),
(127,'Усе перелічене вище.',false),
(127,'Відповіді 1 і 2.',true),
--task8
(128,'Про наближення до нерівнозначного перехрестя.',false),
(128,'Про наближення до перехрестя рівнозначних доріг.',true),
(128,'Про наближення до перехрестя, на якому водій має перевагу в русі.',false),
(128,'Про наближення до перехрестя, на якому необхідно дати дорогу.',false),
--task9
(129,'Лише на гнучкому зчепленні.',false),
(129,'Лише на жорсткому зчепленні.',true),
(129,'На гнучкому або жорсткому зчепленні.',false),
--task10
(130,'Знати причину зупинки, перевірки та огляду транспортного засобу посадовою особою державного органу, яка здійснює нагляд за дорожнім рухом, а також її прізвище і посаду.',false),
(130,'Керувати транспортним засобом і перевозити пасажирів або вантажі дорогами, вулицями чи іншими місцями, де рух не заборонено.',false),
(130,'Оскаржити дії поліцейського в разі порушення ним законодавства.',false),
(130,'Усе перелічене вище.',true),
--task11
(131,'Дозволяється лише на задню вісь.',false),
(131,'Дозволяється.',false),
(131,'Заборонено.',true),
--task12
(132,'Не працюють запори горловин паливних баків.',false),
(132,'Не працює механізм регулювання сидіння водія.',false),
(132,'Не працює пристрій для обігрівання і обдування скла.',false),
(132,'Не працює склопідйомник.',true),
--task13
(133,'Дозволено тільки з частковим заїздом на тротуар.',false),
(133,'Дозволено.',false),
(133,'Заборонено.',true),
--task14
(134,'Тільки на праву смугу, коли знак встановлено по центру над дорогою.',false),
(134,'Тільки на ту смугу, над якою його встановлено.',false),
(134,'Тільки на праву смугу, коли знак встановлено праворуч від дороги.',false),
(134,'Усі наведені вище відповіді.',false),
(134,'Відповіді 2 і 3.',true),
--task15
(135,'Про закінчення додаткової смуги або смуги розгону справа.',true),
(135,'Про наявність смуги для розгону транспортних засобів, яка прилягає з правого боку до проїзної частини.',false),
(135,'Про прилягання справа до проїзної частини смуги, по якій здійснюється рух транспортних засобів у тому ж напрямку.',false),
--task16
(136,'Місце зупинки і стоянки будь-яких автобусів.',false),
(136,'Спеціальну смугу для маршрутних транспортних засобів.',true),
(136,'Спеціальну смугу тільки для маршрутних автобусів.',false),
--task17
(137,'Знак 1.',false),
(137,'Знак 2.',false),
(137,'Знак 3.',false),
(137,'Знак 4.',false),
(137,'Знак 5.',true),
--task18
(138,'Зону, де дозволено стоянку транспортних засобів.',true),
(138,'Місце для посадки і висадки пасажирів.',false),
(138,'Місце для стоянки транспортних засобів.',false),
--task19
(139,'Ви, а потім синій автомобіль.',false),
(139,'Синій автомобіль, а потім Ви.',true),
--task20
(140,'Відсутність дихання.',true),
(140,'Відсутність пульсу на сонних артеріях.',false),
(140,'Розширення зіниць.',false),

--Test№8
--task1
(141,'На третьому і четвертому.',false),
(141,'Тільки на четвертому.',false),
(141,'На другому світлофорі.',true),
(141,'На другому і четвертому.',false),
(141,'На першому і другому.',false),
--task2
(142,'Швидкість, при якій Ви маєте змогу безпечно керувати транспортним засобом та контролювати його рух у конкретних дорожніх умовах.',true),
(142,'Швидкість, яка визначена дорожніми знаками для руху в населених пунктах.',false),
(142,'Швидкість, яка визначена технічною характеристикою даного транспортного засобу.',false),
--task3
(143,'Не повинен, якщо вантаж добре закріплений.',false),
(143,'Повинен завжди.',true),
--task4
(144,'50 км/год.',true),
(144,'60 км/год.',false),
(144,'70 км/год.',false),
(144,'80 км/год.',false),
--task5
(145,'Дозволено за умови, що швидкість автомобіля, який рухається попереду, складає менше 30 км/год.',false),
(145,'Дозволено.',false),
(145,'Заборонено.',true),
--task6
(146,'У місцях А чи Б.',false),
(146,'У місці А.',true),
(146,'У місці Б.',false),
--task7
(147,'Водії білого автомобіля і мотоцикла.',false),
(147,'Водії зеленого і синього автомобілів.',false),
(147,'Водії зеленого, синього транспортних засобів і мотоцикла.',true),
(147,'Ніхто не порушує.',false),
(147,'Усі водії.',false),
--task8
(148,'Відразу розпочати рух, керуючись сигналом світлофора, що дозволяє рух.',false),
(148,'Дати дорогу всім транспортним засобам і пішоходам, що завершують рух через перехрестя.',true),
(148,'Дати дорогу лише транспортним засобам, що завершують рух через перехрестя.',false),
(148,'Дати дорогу тільки пішоходам, що завершують рух через перехрестя.',false),
--task9
(149,'Білий і сірий автомобілі.',true),
(149,'Червоний автомобіль.',false),
--task10
(150,'На автомобілі.',false),
(150,'На мотоцикли.',false),
(150,'На мопеди.',false),
(150,'На автобуси.',false),
(150,'Відповіді 1, 2, 3 і 4.',true),
--task11
(151,'Край проїзної частини.',false),
(151,'Межу між основною смугою руху і смугою гальмування.',true),
(151,'Місця, де дозволено зїзд на узбіччя тільки для зупинки.',false),
--task12
(152,'За відсутності інших транспортних засобів проїхати перехрестя без зупинки.',false),
(152,'Зупинитися біля знака.',false),
(152,'Зупинитися перед дорожньою розміткою «Стоп-лінія».',true),
--task13
(153,'Обидва поставлені правильно.',true),
(153,'Червоний автомобіль.',false),
(153,'Чорний автомобіль.',false),
--task14
(154,'Ліворуч або на розворот.',true),
(154,'Прямо або ліворуч.',false),
(154,'Тільки ліворуч.',false),
--task15
(155,'Початок населеного пункту, в якому діють вимоги даних Правил, що визначають порядок руху в населених пунктах.',false),
(155,'Початок населеного пункту, в якому на даній дорозі не діють вимоги Правил, що визначають порядок руху в населених пунктах.',false),
(155,'Початок щільної забудови в межах населених пунктів, безпосередньо біля проїзної частини.',true),
--task16
(156,'Обличчя і груди хворого змочити холодною водою, дати йому понюхати ватку, змочену нашатирним спиртом.',false),
(156,'Забезпечити доступ повітря до хворого, дати йому таблетку нітрогліцерину (валідолу) під язик.',true),
(156,'Виконати дії, зазначені у відповідях 1 і 2.',false),
--task17
(157,'Дати дорогу велосипедистові.',true),
(157,'Проїхати першим, не даючи дорогу.',false),
--task18
(158,'Дозволено найкоротшим шляхом додому.',false),
(158,'Дозволено під впливом лікарських засобів, що підвищують увагу та швидкість реакції.',false),
(158,'Заборонено.',true),
--task19
(159,'Витягнете ліву руку у вікно в бік.',true),
(159,'Витягнете ліву руку у вікно і зігнете у лікті під прямим кутом вгору.',false),
(159,'Витягнете праву руку в бік.',false),
--task20
(160,'Зліва від педалі на підлозі або спеціальному майданчику.',true),
(160,'На підлозі перед педаллю зчеплення.',false),
(160,'Над педаллю зчеплення, не торкаючись педалі.',false),

--Test№9
--task1
(161,'Інформують про наявність небезпечного нерегульованого пішохідного переходу.',true),
(161,'Інформують про наявність небезпечного регульованого пішохідного переходу.',false),
(161,'Інформують про наявність пішоходів на пішохідному переході.',false),
(161,'Забороняють рух.',false),
--task2
(162,'Дозволено в будь-якому випадку.',false),
(162,'Дозволено, якщо він рухається зі швидкістю менш ніж 30 км/год., дотримуючись заходів безпеки.',false),
(162,'Заборонено.',true),
--task3
(163,'На будь-яких дорогах, переконавшись у відсутності небезпеки.',false),
(163,'Якщо в зоні видимості немає переходу або перехрестя, а дорога має не більш як три смуги для руху в обох напрямках, при цьому пішохід повинен переконатися у відсутності небезпеки.',true),
(163,'Якщо в зоні видимості немає переходу або перехрестя, а дорога має розділювальну смугу, при цьому пішохід повинен переконатися у відсутності небезпеки.',false),
--task4
(164,'Триматися за інший транспортний засіб.',false),
(164,'Їздити, не тримаючись за кермо, та знімати ноги з педалей (підніжок).',false),
(164,'Відповіді 1 і 2.',true),
--task5
(165,'Відсутність перетинів на одному рівні з іншими дорогами, залізничними або трамвайними коліями, пішохідними чи велосипедними доріжками.',false),
(165,'Наявність не менше шести смуг для руху в кожному напрямку.',false),
(165,'Наявність розділювальної смуги.',false),
(165,'Відповіді, зазначені в пунктах 1 і 3.',true),
--task6
(166,'Дозволено прямо або ліворуч.',true),
(166,'Дозволено прямо, праворуч або ліворуч.',false),
(166,'Заборонено.',false),
--task7
(167,'Дозволено.',true),
(167,'Заборонено.',false),
--task8
(168,'Жовтому автомобілю.',false),
(168,'Жовтому і зеленому автомобілям.',true),
(168,'Зеленому, синьому і жовтому автомобілям.',false),
(168,'Чорному і зеленому автомобілям.',false),
--task9
(169,'Аварійна сигналізація.',false),
(169,'Ближнє світло фар.',true),
(169,'Габаритні ліхтарі.',false),
(169,'Протитуманні фари або ближнє світло фар.',false),
--task10
(170,'Правильно, якщо відсутні інші учасники, для руху яких може бути створено перешкоду.',false),
(170,'Неправильно: наїжджати на переривчасті лінії розмітки дозволяється лише під час перестроювання.',true),
--task11
(171,'Дозволено обгін на перехресті, за умови, що швидкість транспортного засобу, який він обганяє, становить менше ніж 30 км/год.',false),
(171,'Заборонено обгін на перехресті згідно Правил.',true),
--task12
(172,'За 100 м перед пішохідним переходом у населеному пункті і 150 м - поза населеним пунктом.',false),
(172,'За 50 м до і після пішохідного переходу в населеному пункті і 100 м - поза населеним пунктом.',false),
(172,'За 50 м перед пішохідним переходом у населеному пункті і 100 м - поза населеним пунктом.',true),
--task13
(173,'Не ближче 10 м.',true),
(173,'Не ближче 15 м.',false),
(173,'Не ближче 20 м.',false),
--task14
(174,'Дати дорогу зустрічному автомобілю.',true),
(174,'Проїхати першим.',false),
--task15
(175,'Повинен зупинитися перед дорожньою розміткою «Стоп-лінія» і продовжити рух, коли ввімкнеться зелений сигнал світлофора.',true),
(175,'Повинен продовжувати рух у наміченому напрямку, незважаючи на ввімкнений заборонний сигнал світлофора.',false),
--task16
(176,'Вжити заходів для звільнення переїзду.',false),
(176,'Висадити людей.',false),
(176,'Виконати обидві дії.',true),
--task17
(177,'За межами дороги і позначена дорожнім знаком 3.9.',false),
(177,'У межах дороги чи поза нею і позначена дорожнім знаком 4.13.',true),
(177,'У межах дороги і позначена дорожнім знаком 1.32.',false),
--task18
(178,'Для зупинки та стоянки транспортних засобів.',false),
(178,'Для руху пішоходів за відсутності пішохідної або велосипедної доріжки.',false),
(178,'Для руху пішоходів за наявності на ній тротуару.',false),
(178,'Для розділення суміжних проїзних частин.',false),
(178,'Відповіді, зазначені в пунктах 3, 4.',true),
--task19
(179,'Білий автомобіль.',false),
(179,'Жовтий автомобіль.',true),
(179,'Синій автомобіль.',false),
(179,'Трамвай.',false),
(179,'Чорний автомобіль.',false),
--task20
(180,'Знати і дотримуватися вимог Правил дорожнього руху і вимагати від інших учасників дорожнього руху виконання Правил.',false),
(180,'Знати і неухильно виконувати вимоги Правил дорожнього руху, бути взаємно ввічливими.',true),
(180,'Тільки знати Правила дорожнього руху, що відносяться до них.',false),

--Test№10
--task1
(181,'Протитуманні фари.',false),
(181,'Габаритні вогні.',false),
(181,'Ближнє світло фар.',false),
(181,'Денні ходові вогні.',true),
(181,'Відповіді 2 і 3.',false),
--task2
(182,'Один за одним або один біля одного, щоб не заважати іншим учасникам дорожнього руху.',false),
(182,'Один за одним, щоб не заважати іншим учасникам дорожнього руху.',true),
--task3
(183,'Тролейбусів.',false),
(183,'Маршрутних транспортних засобів.',false),
(183,'Трамваїв.',true),
--task4
(184,'Завжди надає перевагу',false),
(184,'Надає перевагу тільки під час перестроювання.',false),
(184,'Не дає водієві переваги і не звільняє його від прийняття запобіжних заходів.',true),
--task5
(185,'Дозволено за умови забезпечення безпеки дорожнього руху.',false),
(185,'Заборонено.',true),
--task6
(186,'Дві і більше.',true),
(186,'Три і більше.',false),
(186,'Чотири і більше.',false),
--task7
(187,'Синій автомобіль, зелений автомобіль, трамвай.',false),
(187,'Синій автомобіль, трамвай, зелений автомобіль.',true),
(187,'Трамвай і зелений автомобіль, синій автомобіль.',false),
(187,'Трамвай, синій автомобіль, зелений автомобіль.',false),
--task8
(188,'Має перевагу у русі.',true),
(188,'Повинен зменшити швидкість, а в разі потреби зупинитися, щоб дати можливість маршрутному транспортному засобу розпочати рух.',false),
--task9
(189,'Перший.',true),
(189,'Другий.',false),
(189,'Третій.',false),
--task10
(190,'Перед ділянкою дороги з підвищеною слизькістю проїзної частини.',false),
(190,'Перед звуженням дороги по обидва боки.',true),
(190,'Перед небезпечним поворотом дороги.',false),
--task11
(191,'Про закінчення дороги з розділювальною смугою.',false),
(191,'Про звуження дороги ліворуч.',true),
(191,'Про звуження дороги праворуч.',false),
--task12
(192,'Знак 1.',false),
(192,'Знак 2.',true),
(192,'Знак 3.',false),
(192,'Знак 4.',false),
--task13
(193,'Всіма.',false),
(193,'Знаками 1, 2 і 3.',true),
(193,'Знаками 1, 2 і 5.',false),
(193,'Знаками 1, 2, 3 і 4.',false),
(193,'Знаками 1, 2, 3 і 5.',false),
--task14
(194,'Дозволено.',false),
(194,'Заборонено.',true),
--task15
(195,'Дозволену максимальну швидкість руху на цій ділянці дороги, дублюючи дорожній знак «Обмеження максимальної швидкості».',true),
(195,'Номер дороги або маршруту.',false),
(195,'Рекомендовану швидкість руху на цій ділянці дороги.',false),
--task16
(196,'Місця, призначені для організованого переходу пішоходами проїзної частини.',false),
(196,'Надземні пішохідні переходи.',true),
(196,'Підземні пішохідні переходи.',false),
(196,'Пішохідні доріжки.',false),
--task17
(197,'Дати дорогу трамваю й автомобілю.',false),
(197,'Дати дорогу тільки трамваю.',true),
(197,'Маючи перевагу в русі, проїхати перехрестя першим.',false),
--task18
(198,'Дати дорогу трамваю.',false),
(198,'Проїхати перехрестя першим.',true),
--task19
(199,'Давши дорогу чорному автомобілю.',false),
(199,'Першим.',true),
--task20
(200,'Перед поворотом знизити швидкість, за необхідності ввімкнути знижену передачу, а під час проїзду повороту не збільшувати різко швидкість і не гальмувати.',true),
(200,'Перед поворотом знизити швидкість і натиснути на педаль зчеплення, щоб дати можливість автомобілю рухатися накатом на повороті.',false),
(200,'Допускається будь-яка з наведених дій.',false);